# Assignment: Datacleaning Pandas

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
for i in range (0, len(df["FlightNumber"])):
   
    if pd.isna(df.loc[i, "FlightNumber"]):
        df.loc[i,"FlightNumber"] = df.loc[i-1, "FlightNumber"]+10
    else:
        df.loc[i,"FlightNumber"] = df.loc[i,"FlightNumber"]

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [6]:
fromto = df["From_To"]

In [8]:
fromcity= []
tocity= []
for i in fromto:
    k = i.split("_")
    fromcity.append(k[0])
    tocity.append(k[1])

In [9]:
df2 = pd.DataFrame({"From": tocity, "To" :fromcity})

In [10]:
df2

        From        To
0      paris    LoNDon
1      miLAN    MAdrid
2  StockhOlm    londON
3      PaRis  Budapest
4     londOn  Brussels

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [11]:
df2["From"] = df2.From.str.capitalize()
df2["To"] = df2.To.str.capitalize()

In [12]:
df2

        From        To
0      Paris    London
1      Milan    Madrid
2  Stockholm    London
3      Paris  Budapest
4     London  Brussels

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [13]:
df.drop("From_To",1, inplace = True)

In [14]:
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [15]:
df["From"] = df2.From
df["To"] = df2.To

In [16]:
df

   FlightNumber  RecentDelays              Airline       From        To
0       10045.0      [23, 47]               KLM(!)      Paris    London
1       10055.0            []    <Air France> (12)      Milan    Madrid
2       10065.0  [24, 43, 87]  (British Airways. )  Stockholm    London
3       10075.0          [13]       12. Air France      Paris  Budapest
4       10085.0      [67, 32]          "Swiss Air"     London  Brussels

5.In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [17]:
df["RecentDelays"]

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [18]:
df_delays=pd.DataFrame(df["RecentDelays"].values.tolist())
df_delays.columns = ['delay_{}'.format(n) for n in range(1, len(df_delays.columns)+1)]

In [19]:
df_delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [20]:
df

   FlightNumber  RecentDelays              Airline       From        To
0       10045.0      [23, 47]               KLM(!)      Paris    London
1       10055.0            []    <Air France> (12)      Milan    Madrid
2       10065.0  [24, 43, 87]  (British Airways. )  Stockholm    London
3       10075.0          [13]       12. Air France      Paris  Budapest
4       10085.0      [67, 32]          "Swiss Air"     London  Brussels

In [22]:
df.drop('RecentDelays', axis=1, inplace = True)

In [23]:
df

   FlightNumber              Airline       From        To
0       10045.0               KLM(!)      Paris    London
1       10055.0    <Air France> (12)      Milan    Madrid
2       10065.0  (British Airways. )  Stockholm    London
3       10075.0       12. Air France      Paris  Budapest
4       10085.0          "Swiss Air"     London  Brussels

In [24]:
df = df.join(df_delays)

In [25]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM(!),Paris,London,23.0,47.0,NaN
1,10055.0,<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,10065.0,(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,10075.0,12. Air France,Paris,Budapest,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",London,Brussels,67.0,32.0,NaN